
# it contains definitions for both latex and html
# from http://emacs.stackexchange.com/questions/255/new-line-in-title-of-an-org-mode-exported-html-document
#+MACRO: NEWLINE @@latex:\\@@ @@html:<br>@@

#+TITLE: Org-mode Latex Export {{{NEWLINE}}} Example

#+AUTHOR: Derek Feichtinger
#+EMAIL: derek.feichtinger@psi.ch
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:t todo:t |:t

# if the creator option is t, then use the string from CREATOR or the
# default if that is not set. The string is put at the end of the
# document.
#+OPTIONS: creator:t

#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

# By default I do not want that source code blocks are evaluated on export. Usually
# I want to evaluate them interactively and retain the original results.
#+PROPERTY: header-args :eval never-export

# #+OPTIONS: texht:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper]

# show hyperlinks in blue font
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=blue}

# LATEX_HEADER_EXTRA lines will not be loaded when previewing LaTeX snippets

# package to typeset units in equations
#+LATEX_HEADER_EXTRA: \usepackage{units}

# package that allows to put longer text parts as comments that are
# not put into the PDF document
#+LATEX_HEADER_EXTRA: \usepackage{comment}

# Needed for rotating floats, e.g. for placing the sidewaystable
#+LATEX_HEADER_EXTRA: \usepackage{rotfloat}

# lmodern provides Latin Modern Type1 fonts. If this is left
# out, Type3 fonts are used which results in a document from
# which one cannot copy (symbol crap) and that is not searchable
#+LATEX_HEADER_EXTRA: \usepackage{lmodern}

# for tables where the text in a cell can flow into the next
# line. Width can be defined
#+LATEX_HEADER_EXTRA: \usepackage{tabularx}

* Version information
  #+BEGIN_SRC emacs-lisp :results output :exports results :eval query-export
    (princ (concat (format "Emacs version: %s\n" (emacs-version))
                   (format "org version: %s\n" (org-version))))
    
  #+END_SRC

  #+RESULTS:
  : Emacs version: GNU Emacs 25.2.1 (x86_64-pc-linux-gnu, GTK+ Version 3.18.9)
  :  of 2017-11-25
  : org version: 9.1.2

*** nicer table formatting using booktab style

    Some [[http://www.inf.ethz.ch/personal/markusp/teaching/guides/guide-tables.pdf][interesting tips]] for \myindex{booktab style tables} by M. Püschel.
  
    Booktabs can be turned on by default for all tables by
    setting this variable for the document or globally:
    : org-latex-tables-booktabs: t

    Whether table captions appear above or below the table can be configured using this
    variable setting:
    : org-latex-table-caption-above: nil

    #+NAME: tblDefault
    #+CAPTION: default table
    #+ATTR_LATEX: :placement [H]
    | Column 1 | Column 2 | Column 3 | Column 4 |
    |----------+----------+----------+----------|
    |        1 |       10 |      100 |     1000 |
    |        2 |       11 |      101 |     1001 |
    |        3 |       12 |      102 |     1002 |
    |        4 |       13 |      103 |     1003 |
    |        5 |       14 |      104 |     1004 |
    |----------+----------+----------+----------|
    |       15 |       60 |      510 |     5010 |
    #+TBLFM: @>$1..@$4=vsum(@I..II)

    #+NAME: tblBooktabs
    #+CAPTION: table using booktabs style
    #+ATTR_LATEX: :placement [H] :booktabs t
    | Column 1 | Column 2 | Column 3 | Column 4 |
    |----------+----------+----------+----------|
    |        1 |       10 |      100 |     1000 |
    |        2 |       11 |      101 |     1001 |
    |        3 |       12 |      102 |     1002 |
    |        4 |       13 |      103 |     1003 |
    |        5 |       14 |      104 |     1004 |
    |----------+----------+----------+----------|
    |       15 |       60 |      510 |     5010 |
    #+TBLFM: @>$1..@$4=vsum(@I..II)

  
**** COMMENT location of the src table

    #+ORGTBL: SEND salesfigures orgtbl-to-latex :splice t :skip 2
    | Month | Days | Nr sold | per day |
    |-------+------+---------+---------|
    | Jan   |   23 |      55 |     2.4 |
    | Feb   |   21 |      16 |     0.8 |
    | March |   22 |     278 |    12.6 |
    #+TBLFM: $4=$3/$2;%.1f
   
